<template>
  <div class="table">
    <div class="carousel">
      <el-carousel height="300px" motion-blur indicator-position="none">
        <el-carousel-item v-for="item in 4" :key="item">
          <img
            src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
            alt=""
          />
        </el-carousel-item>
      </el-carousel>
      <div class="classLogo">
        <svg
          t="1715136697323"
          class="icon"
          viewBox="0 0 1711 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="3356"
          width="200"
          height="200"
        >
          <path
            d="M1499.476696 594.168587c-32.404424 0-72.419324-0.380334-72.818674-0.380334l53.710713-229.523731h43.167865V307.423663h-43.167865l-68.912648 286.349377h-53.919897l69.110421-286.349377a23.105267 23.105267 0 0 0-4.564003-0.665584c-1.141001 0-1.795175 0.224397-1.981538 0.665584a38.516385 38.516385 0 0 1-13.026426 20.880315 31.47641 31.47641 0 0 1-19.560558 6.188028h-0.178757c-4.22931-0.019017-9.831624-0.026623-16.662416-0.026623-11.691455 0-22.930314 0.026623-23.036807 0.026623v56.194292l29.685039-17.76158v71.266914l-29.685039 16.274475v133.306933h-61.195679v-97.52895l-56.490952 33.617689-39.174363-51.751995 95.665315-58.069337V334.492006h-15.677352v74.438896l-58.057927 35.26073V270.036868h58.046517v32.024091h15.677352V247.216851h61.191876v51.725372h16.677629l18.929204-51.725372h61.043545l-11.942475 26.726043h149.577605c0 2.137475-0.281447 233.524841 0 269.169708a63.614601 63.614601 0 0 1-3.662613 22.89228 42.274082 42.274082 0 0 1-9.964741 15.529022 41.376494 41.376494 0 0 1-14.11418 8.98348 50.204037 50.204037 0 0 1-16.107129 3.251853c-6.442851 0.258627-19.427441 0.380334-38.581042 0.380333z m-8.770493-56.513772c0.04564 0 4.678103 0.060853 10.713998 0.060853 3.461036 0 6.735708-0.019017 9.740344-0.060853a14.095164 14.095164 0 0 0 10.896558-3.506676c2.327642-2.548235 3.369756-6.785152 3.282279-13.3383-0.174953-12.980786 0-122.490245 0-127.145529z m-1360.103442-27.326971s44.750053-24.668438 44.78048-52.318692 0-57.365719 0-57.36572h-48.53057v-34.477242h48.53057V281.82721h-48.53057v-34.347929h149.048942V281.82721h-37.451452v84.319963h37.451452v34.496259h-37.451452v60.944659c0 40.00349-13.471417 55.372771-27.790977 67.661351s-80.056423 64.154675-80.056423 64.154674z m380.504767 4.316787s53.334183-27.616024 53.372217-60.853379 0-53.14782 0-53.14782h-48.545783v-34.477242h48.530569V281.82721h-48.530569v-34.347929h169.87601V281.82721h-58.263307v84.160223h47.572129l40.18605 64.169888V338.310556h-70.087879v-32.488098h70.087879V247.216851h59.130467v58.605607h43.863876L805.223318 247.216851h58.03891l19.073731 91.093705h-107.900648v254.36332h-59.130467v-108.201111l-58.442064 108.201111h-59.864511s55.197818-101.997869 59.864511-110.966136 15.669745-28.251181 4.271147-45.164618c-9.717524-14.422251-21.736066-31.252013-25.063986-35.895886h-8.523276v57.194569c0 40.00349-13.456203 59.122861-27.787174 71.407637s-73.590752 63.854211-73.590752 63.854211z m-73.636391 78.409578l-43.50256-223.609543v223.609543H331.312417v-116.382087l-54.988634 116.382087H212.218552L331.312417 341.159255V281.743537H287.813661V247.216851h182.44984v34.526686h-76.294924v83.232209h63.667848l43.844859 228.078463z m394.375534-0.311873s-35.777983-92.938323-41.638925-108.269571-9.025317-34.990693 0-54.539841 28.471775-64.299201 28.471775-64.299201h59.602081s-25.756193 56.198095-30.981976 69.559215-7.173092 20.298405-2.685156 33.142272 47.922036 124.41093 47.922036 124.410929z m339.132076-0.152134l-141.103772-189.292041-112.620587 189.292041-30.502756-75.80049L1039.740829 247.216851h77.918949s-65.649386 118.481528-66.683894 119.025406c23.006381 0 34.914626 5.879958 46.278995 20.693952s155.004966 205.653993 155.004966 205.653993z"
            fill="#CD292A"
            p-id="3357"
          ></path>
          <path
            d="M293.830539 689.160711v-6.511311h37.588372v6.511311a9.021513 9.021513 0 0 0-5.860941 2.635712 14.566778 14.566778 0 0 0-1.361595 7.724576v16.810746q-1.901668-0.117903-3.076899-0.117904a109.197585 109.197585 0 0 0-19.830594 3.019849 83.038239 83.038239 0 0 1-16.73468 2.129868 38.432712 38.432712 0 0 1-29.597562-12.223922 40.657664 40.657664 0 0 1-11.307318-28.502201 42.140965 42.140965 0 0 1 11.927262-30.046356 39.102099 39.102099 0 0 1 29.567135-12.577633 38.056182 38.056182 0 0 1 25.276973 9.173647 24.101741 24.101741 0 0 0 2.308625-8.34452h6.332554l0.711224 28.057211h-6.458064q-6.085338-20.480965-23.793672-20.480965A18.51464 18.51464 0 0 0 273.452264 654.173822q-5.549067 7.758806-5.549067 26.049049a88.237399 88.237399 0 0 0 1.627828 19.533935 18.176144 18.176144 0 0 0 6.275504 10.360287 18.856941 18.856941 0 0 0 12.045166 3.67022 19.435048 19.435048 0 0 0 10.892755-2.841092q4.301573-2.841092 4.301573-11.189415v-2.958996q0-7.043779-9.215484-7.637099z m132.98365 3.848976l-0.353711 26.695617H353.2957v-6.572165h1.182838a10.094054 10.094054 0 0 0 7.842479-2.221148 12.254349 12.254349 0 0 0 1.806585-7.606673v-47.469438a11.790342 11.790342 0 0 0-1.901668-7.663723 10.307041 10.307041 0 0 0-7.755003-2.160295h-1.182837v-6.556951h43.042355v6.572165h-1.597401a10.094054 10.094054 0 0 0-7.842479 2.221148 12.254349 12.254349 0 0 0-1.806585 7.606672v45.795971a24.645618 24.645618 0 0 0 0.593321 6.807972 5.602314 5.602314 0 0 0 3.107325 2.871519 22.25332 22.25332 0 0 0 8.78951 1.213264 21.180779 21.180779 0 0 0 15.745812-5.298047 28.053408 28.053408 0 0 0 7.104632-14.235888z m21.998496-13.69201a41.292821 41.292821 0 0 1 6.035894-21.131336 37.390598 37.390598 0 0 1 16.354346-15.243771 50.584371 50.584371 0 0 1 22.108793-4.944337q21.192189 0 33.237355 12.223922a41.076031 41.076031 0 0 1 12.045166 29.981699 39.77529 39.77529 0 0 1-12.014739 29.004242 43.905713 43.905713 0 0 1-32.674461 12.132642 51.017951 51.017951 0 0 1-25.010739-5.978844 34.751083 34.751083 0 0 1-15.479578-16.069095 47.731869 47.731869 0 0 1-4.602037-19.956105z m24.740702-0.65037q0 18.52605 4.97096 26.726043a16.213622 16.213622 0 0 0 14.798781 8.226616 17.594233 17.594233 0 0 0 15.449152-7.488769q5.210571-7.488769 5.21057-26.24302 0-17.164456-4.883483-25.630682a18.396737 18.396737 0 0 0-30.571216-0.59332q-4.974764 7.850086-4.974764 25.022148z m141.567779-1.658255a35.14663 35.14663 0 0 1 17.757776 7.545819 18.256014 18.256014 0 0 1 5.917991 14.117984 18.130504 18.130504 0 0 1-7.576245 15.388298q-7.576246 5.625134-25.155266 5.625134h-42.087718v-6.553148a12.630879 12.630879 0 0 0 8.405373-1.981538 10.965018 10.965018 0 0 0 2.072818-7.842479v-47.058679a11.478469 11.478469 0 0 0-1.954914-7.755002 12.170676 12.170676 0 0 0-8.523277-2.072819v-6.568361l30.83745-0.886177h4.381443q20.834676 0 28.410921 5.180143a16.240245 16.240245 0 0 1 7.576246 14.117984 15.042195 15.042195 0 0 1-5.001387 11.410009 34.990693 34.990693 0 0 1-15.061211 7.351849z m-19.651838-3.423003h4.084783a13.604533 13.604533 0 0 0 9.706114-3.042669 14.239691 14.239691 0 0 0 3.194802-10.565667 16.810746 16.810746 0 0 0-2.011965-8.876987 9.128007 9.128007 0 0 0-5.298047-4.18367 37.227054 37.227054 0 0 0-9.679491-0.947031z m0 7.226339v22.78959a14.304347 14.304347 0 0 0 0.680797 5.031814 5.883761 5.883761 0 0 0 2.662335 2.871519 11.204628 11.204628 0 0 0 5.594708 1.141001 9.660474 9.660474 0 0 0 8.435799-3.96688 20.602672 20.602672 0 0 0 2.810666-11.896835 22.05935 22.05935 0 0 0-1.833208-9.915298 9.550177 9.550177 0 0 0-5.031814-4.82263 27.509531 27.509531 0 0 0-9.470307-1.243691z m81.064307 17.2139l-1.521335 3.966879a19.446458 19.446458 0 0 0-1.658254 5.917991 4.316787 4.316787 0 0 0 1.954915 4.054357 13.186167 13.186167 0 0 0 6.393408 1.141001v6.598788h-26.51686v-6.572165q7.576246 0 12.725963-12.90472l24.683652-62.211169h6.925875l25.155265 62.150316a24.919459 24.919459 0 0 0 6.747119 11.098135 11.071512 11.071512 0 0 0 5.800087 1.863635v6.575968h-39.847553v-6.572165a12.996 12.996 0 0 0 6.690069-1.034507 3.225229 3.225229 0 0 0 1.30074-2.635712 9.50834 9.50834 0 0 0-1.064934-3.72727l-0.760667-1.833208-2.320035-5.876154z m2.544432-6.807972h19.473081l-10.002774-23.961018z m148.489851 1.776158l-0.346104 26.71083h-73.160975v-6.572165h1.182838a10.094054 10.094054 0 0 0 7.842479-2.221148 12.254349 12.254349 0 0 0 1.806585-7.606673v-47.469438a11.790342 11.790342 0 0 0-1.901668-7.663723 10.307041 10.307041 0 0 0-7.755003-2.160295h-1.182837v-6.556951h43.046159v6.572165h-1.597402a10.094054 10.094054 0 0 0-7.842479 2.221148 12.254349 12.254349 0 0 0-1.806584 7.606672v45.795971a24.645618 24.645618 0 0 0 0.59332 6.807972 5.602314 5.602314 0 0 0 3.107326 2.871519 22.25332 22.25332 0 0 0 8.78951 1.213264 21.180779 21.180779 0 0 0 15.745811-5.298047 28.057211 28.057211 0 0 0 7.104632-14.235888z m98.985627-8.819937v19.119371a11.923459 11.923459 0 0 0 1.863635 7.663723 10.295631 10.295631 0 0 0 7.785429 2.160295h1.833208v6.587378h-43.498756v-6.572165h1.422448a9.995167 9.995167 0 0 0 7.785429-2.221148 12.254349 12.254349 0 0 0 1.806585-7.606673v-47.469438a11.923459 11.923459 0 0 0-1.863635-7.663723 10.196744 10.196744 0 0 0-7.724576-2.160295h-1.954915v-6.556951l32.556558-0.711224q12.193496 0 18.853137 0.65037a32.484294 32.484294 0 0 1 12.223923 3.609366 20.431522 20.431522 0 0 1 8.367339 7.842479 21.036252 21.036252 0 0 1 2.810666 10.683572 19.777348 19.777348 0 0 1-4.883484 13.467613 23.177531 23.177531 0 0 1-12.193496 7.397489 83.099092 83.099092 0 0 1-19.267701 1.806585z m0-7.104632h3.906026q9.413257 0 12.55101-4.115209a17.655087 17.655087 0 0 0 3.137752-10.980232 19.088944 19.088944 0 0 0-2.308625-9.972347 10.744425 10.744425 0 0 0-5.860941-4.970961 40.478907 40.478907 0 0 0-11.410009-1.141001z m94.151587 4.26354v19.830595a26.281053 26.281053 0 0 0 0.65037 7.427916 5.682184 5.682184 0 0 0 3.491463 2.901945 24.318531 24.318531 0 0 0 8.64118 1.141001 25.938753 25.938753 0 0 0 11.573552-1.954915 17.666497 17.666497 0 0 0 6.629215-6.865022 36.633734 36.633734 0 0 0 4.233113-10.478191h6.648231l-0.532467 26.341906h-73.404388v-6.545541h1.479498a9.995167 9.995167 0 0 0 7.785429-2.221148 12.254349 12.254349 0 0 0 1.806585-7.606673v-47.587342a11.923459 11.923459 0 0 0-1.863635-7.663722 10.196744 10.196744 0 0 0-7.724576-2.160295h-1.479497v-6.439048h68.368771l1.182837 20.777625h-6.648231a34.808133 34.808133 0 0 0-3.96688-8.671606 10.793868 10.793868 0 0 0-4.408067-4.141833 21.549703 21.549703 0 0 0-7.488769-0.916604h-14.977537v27.7035h7.458342a9.306764 9.306764 0 0 0 7.074205-2.011965 13.57791 13.57791 0 0 0 1.981538-7.929956h6.720495v27.228084h-6.690068q0.060853-0.760667 0.060853-1.141001a13.239413 13.239413 0 0 0-1.449071-6.214651q-1.449071-2.780239-7.427915-2.780239z m68.345951-2.011965a41.292821 41.292821 0 0 1 6.035894-21.131335 37.386795 37.386795 0 0 1 16.354346-15.243772 50.584371 50.584371 0 0 1 22.108793-4.944337q21.192189 0 33.237355 12.223923a41.076031 41.076031 0 0 1 12.045166 29.981699 39.77529 39.77529 0 0 1-12.014739 29.004241 43.909516 43.909516 0 0 1-32.674461 12.132643 51.017951 51.017951 0 0 1-25.006936-5.978845 34.751083 34.751083 0 0 1-15.479578-16.069095 47.731869 47.731869 0 0 1-4.598233-19.959908z m24.740702-0.65037q0 18.52605 4.97096 26.726043a16.213622 16.213622 0 0 0 14.798781 8.199993 17.594233 17.594233 0 0 0 15.449152-7.488769q5.210571-7.488769 5.21057-26.24302 0-17.164456-4.883483-25.630682a18.396737 18.396737 0 0 0-30.571217-0.59332q-4.963354 7.872906-4.963353 25.044968z m121.794234 5.503427v19.119371a11.927262 11.927262 0 0 0 1.863635 7.663723 10.295631 10.295631 0 0 0 7.785429 2.160295h1.833208v6.587378h-43.494953v-6.572165h1.422448a9.995167 9.995167 0 0 0 7.785429-2.221148 12.254349 12.254349 0 0 0 1.806585-7.606673v-47.469438a11.923459 11.923459 0 0 0-1.863635-7.663723 10.192941 10.192941 0 0 0-7.724576-2.160295h-1.954914v-6.556951l32.556557-0.711224q12.193496 0 18.853138 0.65037a32.484294 32.484294 0 0 1 12.223922 3.609366 20.431522 20.431522 0 0 1 8.36734 7.842479 21.036252 21.036252 0 0 1 2.810665 10.683572 19.777348 19.777348 0 0 1-4.883484 13.467613 23.177531 23.177531 0 0 1-12.193495 7.397489 83.099092 83.099092 0 0 1-19.267701 1.806585z m0-7.104632h3.906026q9.413257 0 12.55101-4.115209a17.655087 17.655087 0 0 0 3.137752-10.980232 19.088944 19.088944 0 0 0-2.308625-9.972347 10.744425 10.744425 0 0 0-5.838121-4.940534 40.478907 40.478907 0 0 0-11.410009-1.141001z m135.528081 15.924569l-0.35371 26.695617h-73.141958v-6.556952h1.182837a10.094054 10.094054 0 0 0 7.84248-2.221148 12.254349 12.254349 0 0 0 1.806584-7.606673v-47.469438a11.790342 11.790342 0 0 0-1.901668-7.663723 10.307041 10.307041 0 0 0-7.755002-2.160295h-1.175231v-6.556951h43.034749v6.572165h-1.597402a10.094054 10.094054 0 0 0-7.842479 2.221148 12.254349 12.254349 0 0 0-1.806584 7.606672v45.795971a24.641815 24.641815 0 0 0 0.59332 6.807972 5.602314 5.602314 0 0 0 3.107326 2.871519 22.25332 22.25332 0 0 0 8.78951 1.213264 21.180779 21.180779 0 0 0 15.745811-5.298047 28.053408 28.053408 0 0 0 7.104632-14.235888z m52.364332-11.661029v19.830595a26.284856 26.284856 0 0 0 0.650371 7.427916 5.682184 5.682184 0 0 0 3.491463 2.901945 24.318531 24.318531 0 0 0 8.641179 1.141001 25.938753 25.938753 0 0 0 11.573552-1.954915 17.666497 17.666497 0 0 0 6.629215-6.865022 36.633734 36.633734 0 0 0 4.233113-10.478191h6.648232l-0.532467 26.341906h-73.404388v-6.545541h1.479498a9.995167 9.995167 0 0 0 7.785429-2.221148 12.254349 12.254349 0 0 0 1.806584-7.606673v-47.587342a11.927262 11.927262 0 0 0-1.863634-7.663722 10.196744 10.196744 0 0 0-7.724576-2.160295h-1.479498v-6.439048h68.368771l1.182838 20.777625h-6.648232a34.804329 34.804329 0 0 0-3.966879-8.671606 10.793868 10.793868 0 0 0-4.408067-4.141833 21.549703 21.549703 0 0 0-7.488769-0.916604h-14.973735v27.7035h7.458343a9.306764 9.306764 0 0 0 7.074205-2.011965 13.57791 13.57791 0 0 0 1.981538-7.929956h6.716692v27.228084h-6.690069q0.060853-0.760667 0.060854-1.141001a13.243217 13.243217 0 0 0-1.449071-6.214651q-1.449071-2.780239-7.427916-2.780239z"
            fill="#CD292A"
            p-id="3358"
          ></path>
        </svg>
      </div>
    </div>
    <div class="more">
      <div class="customizate">
        <div class="recommend">
          <p class="anchorTitle">主播推荐</p>
          <el-carousel height="220px" motion-blur indicator-position="none">
            <el-carousel-item v-for="item in 4" :key="item">
              <img
                src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
                alt=""
              />
            </el-carousel-item>
          </el-carousel>
        </div>
        <div class="classRank">
          <p class="title">
            直播排行榜<i class="iconfont icon-youjiantou"></i>
          </p>
          <div class="rank">
            <li>
              <em class="rank">1</em>
              <img
                src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
                alt="直播头像"
              />
              <p class="anchorName">无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌</p>
              <!-- 进入直播 -->
              <button class="enter">直播间</button>
            </li>
            <li>
              <em class="rank">1</em>
              <img
                src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
                alt="直播头像"
              />
              <p class="anchorName">无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌</p>
              <!-- 进入直播 -->
              <button class="enter">直播间</button>
            </li>
            <li>
              <em class="rank">1</em>
              <img
                src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
                alt="直播头像"
              />
              <p class="anchorName">无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌</p>
              <!-- 进入直播 -->
              <button class="enter">直播间</button>
            </li>
            <li>
              <em class="rank">1</em>
              <img
                src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
                alt="直播头像"
              />
              <p class="anchorName">无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌</p>
              <!-- 进入直播 -->
              <button class="enter">直播间</button>
            </li>
            <li>
              <em class="rank">1</em>
              <img
                src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
                alt="直播头像"
              />
              <p class="anchorName">无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌</p>
              <!-- 进入直播 -->
              <button class="enter">直播间</button>
            </li>
            <li>
              <em class="rank">1</em>
              <img
                src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
                alt="直播头像"
              />
              <p class="anchorName">无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌</p>
              <!-- 进入直播 -->
              <button class="enter">直播间</button>
            </li>
          </div>
        </div>
        <div class="wonderfulVideo">
          <p class="title">精彩视频<i class="iconfont icon-youjiantou"></i></p>
          <div class="video">
            <div class="wonders">
              <div class="cover">
                <img
                  src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
                  alt="直播头像"
                />
              </div>
              <div class="videoInfo">
                <!-- 视频信息 -->
                <p class="desrip">
                  <!-- 视频描述 -->
                  无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌
                </p>
                <div class="footer">
                  <!-- 视频作者 -->
                  <!-- 上传时间 -->
                  <p class="anchor">无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌</p>
                  <p class="uploadTime">2024-05-07</p>
                </div>
              </div>
              <button class="lookMore">
                <i class="iconfont icon-youjiantou"></i>
              </button>
            </div>
            <div class="wonders">
              <div class="cover">
                <img
                  src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
                  alt="直播头像"
                />
              </div>
              <div class="videoInfo">
                <!-- 视频信息 -->
                <p class="desrip">
                  <!-- 视频描述 -->
                  无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌
                </p>
                <div class="footer">
                  <!-- 视频作者 -->
                  <!-- 上传时间 -->
                  <p class="anchor">无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌</p>
                  <p class="uploadTime">2024-05-07</p>
                </div>
              </div>
              <button class="lookMore">
                <i class="iconfont icon-youjiantou"></i>
              </button>
            </div>
            <div class="wonders">
              <div class="cover">
                <img
                  src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
                  alt="直播头像"
                />
              </div>
              <div class="videoInfo">
                <!-- 视频信息 -->
                <p class="desrip">
                  <!-- 视频描述 -->
                  无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌
                </p>
                <div class="footer">
                  <!-- 视频作者 -->
                  <!-- 上传时间 -->
                  <p class="anchor">无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌</p>
                  <p class="uploadTime">2024-05-07</p>
                </div>
              </div>
              <button class="lookMore">
                <i class="iconfont icon-youjiantou"></i>
              </button>
            </div>
            <div class="wonders">
              <div class="cover">
                <img
                  src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
                  alt="直播头像"
                />
              </div>
              <div class="videoInfo">
                <!-- 视频信息 -->
                <p class="desrip">
                  <!-- 视频描述 -->
                  无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌
                </p>
                <div class="footer">
                  <!-- 视频作者 -->
                  <!-- 上传时间 -->
                  <p class="anchor">无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌</p>
                  <p class="uploadTime">2024-05-07</p>
                </div>
              </div>
              <button class="lookMore">
                <i class="iconfont icon-youjiantou"></i>
              </button>
            </div>
            <div class="wonders">
              <div class="cover">
                <img
                  src="https://img0.baidu.com/it/u=3383294599,716789071&fm=253&fmt=auto&app=120&f=JPEG?w=501&h=500"
                  alt="直播头像"
                />
              </div>
              <div class="videoInfo">
                <!-- 视频信息 -->
                <p class="desrip">
                  <!-- 视频描述 -->
                  无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌
                </p>
                <div class="footer">
                  <!-- 视频作者 -->
                  <!-- 上传时间 -->
                  <p class="anchor">无敌无敌无敌无敌无敌无敌无敌无敌无敌无敌</p>
                  <p class="uploadTime">2024-05-07</p>
                </div>
              </div>
              <button class="lookMore">
                <i class="iconfont icon-youjiantou"></i>
              </button>
            </div>
          </div>
        </div>
      </div>

      <div class="classNotes">
        <div class="currentClass"><p>LOL</p></div>
        <div class="smallClass">
          <button>全部</button><button>打野</button><button>打野</button
          ><button>打野</button><button>打野</button><button>打野</button
          ><button>打野</button><button>打野</button><button>打野</button
          ><button>打野</button><button>打野</button>
        </div>
      </div>
      <!-- 在线直播 -->
      <div class="online">
        <div class="divider">
          <p class="title">在线直播</p>
        </div>
        <div class="tableShow">
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
        </div>
        <div class="page">
          <el-pagination background layout="prev, pager, next" :total="1000" />
        </div>
      </div>

      <!-- 往期回顾 -->
      <div class="past">
        <div class="divider">
          <p class="title">往期精彩回顾</p>
        </div>
        <div class="tableShow">
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
          <videoIndex></videoIndex>
        </div>
        <div class="page">
          <el-pagination background layout="prev, pager, next" :total="1000" />
        </div>
      </div>
    </div>
  </div>
</template>
<script setup lang="ts">
import videoIndex from "@/components/video/videoIndex.vue";
</script>
<style lang="scss" scoped>
@import url("http://at.alicdn.com/t/c/font_4515498_7hzpu4sfpru.css");
.el-pagination {
  --el-pagination-button-bg-color: var(--el-bg-color);
}
.classLogo {
  position: absolute;
  top: 0;
  left: 0;
  svg {
    height: 100px;
  }
}
.table {
  background-color: #f2f5f6;
  min-height: 100vh;
}
.carousel {
  position: relative;
  img {
    width: 100%;
    height: 100%;
  }
}
.more {
  padding: 20px;
  padding-top: 0;
  min-height: 100vh;
  position: relative;
  z-index: 10;
  .customizate {
    display: flex;
    justify-content: space-between;
    background-color: #fff;
    height: 260px;
    margin-top: -30px;
    width: 100%;
    border-radius: 6px;
    .recommend {
      padding: 20px;
      padding-right: 0;
      padding-top: 0;
      min-width: 300px;
      width: 30%;
      .anchorTitle {
        cursor: pointer;
        font-size: 15px;
        margin: 5px 0;
        font-weight: 600;
        text-align: center;
        .iconfont {
          font-size: 12px;
        }
      }
      img {
        height: 100%;
        width: 100%;
      }
    }
    .classRank {
      min-width: 350px;
      width: 30%;
      .title {
        margin: 5px 0;
        cursor: pointer;
        font-size: 15px;
        font-weight: 600;
        text-align: center;
        .iconfont {
          font-size: 12px;
        }
      }
      .rank {
        margin-top: 3px;
        li {
          transition-duration: 0.5s;
          border-radius: 4px;
          display: flex;
          gap: 15px;
          align-items: center;
          justify-content: space-between;
          padding: 3px 10px;
          em {
            font-size: 15px;
            font-weight: 800;
          }
          img {
            width: 30px;
            height: 30px;
            border-radius: 50%;
          }
          .anchorName {
            width: 50%;
            white-space: nowrap;
            text-overflow: ellipsis;
            overflow: hidden;
          }
          .enter {
            border: none;
            background-color: transparent;
            cursor: pointer;
            color: var(--el-color-success-light-3);
          }
        }
        li:hover {
          background-color: var(--el-color-info-light-8);
        }
      }
    }
    .wonderfulVideo {
      padding-right: 20px;
      min-width: 350px;
      width: 35%;
      .title {
        margin: 5px 0;
        cursor: pointer;
        font-size: 15px;
        font-weight: 600;
        text-align: center;
        .iconfont {
          font-size: 12px;
        }
      }
      .video {
        margin-top: 10px;
        height: 210px;
        overflow: auto;

        .wonders {
          cursor: pointer;
          transition-duration: 0.5s;
          height: 100px;
          margin-bottom: 5px;
          display: flex;
          justify-content: space-between;
          align-items: center;
          gap: 10px;
          .cover {
            width: 200px;
            height: 100px;
            border-radius: 4px;
            img {
              width: 100%;
              height: 100%;
              border-radius: 4px;
            }
          }
          .videoInfo {
            height: 100px;
            display: flex;
            flex-direction: column;
            justify-content: space-between;
          }
          .desrip {
            max-width: 320px;
            display: -webkit-box;
            -webkit-line-clamp: 2;
            -webkit-box-orient: vertical;
            overflow: hidden;
          }
          .footer {
            display: flex;
            align-items: center;
            justify-content: space-between;
            color: var(--el-color-success-light-7);
            .anchor {
              max-width: 120px;
              white-space: nowrap;
              text-overflow: ellipsis;
              overflow: hidden;
            }
          }
          button {
            background-color: transparent;
            border: none;
            cursor: pointer;
            height: 50px;
          }
        }
        .wonders:hover {
          background-color: var(--el-color-info-light-8);
        }
      }
      .video::-webkit-scrollbar {
        /*滚动条整体样式*/
        width: 5px; /*高宽分别对应横竖滚动条的尺寸*/
        height: 5px;
        background: transparent;
      }
      .video::-webkit-scrollbar-thumb {
        /*滚动条里面小方块*/
        border-radius: 10px;
        box-shadow: inset 0 0 5px rgba(0, 0, 0, 0.2);
        background: transparent;
      }
      .video::-webkit-scrollbar-track {
        /*滚动条里面轨道*/
        box-shadow: inset 0 0 5px rgba(0, 0, 0, 0);
        border-radius: 10px;
        background: transparent;
      }
      .video::-webkit-scrollbar-button {
        /* 滚动条两端的按钮 */
        background: transparent;
        display: none;
      }
    }
    @media screen and (max-width: 1000px) {
      .recommend {
        width: 50%;
      }
      .classRank {
        width: 50%;
      }
      .wonderfulVideo {
        display: none;
      }
    }
    @media screen and (max-width: 700px) {
      .recommend {
        min-width: auto;
      }
      .classRank {
        min-width: auto;
        .rank li {
          gap: 5px;
        }
      }
    }
    @media screen and (max-width: 500px) {
      .recommend {
        width: 100%;
        padding-right: 20px;
      }
      .classRank {
        display: none;
      }
    }
  }
}
.online,
.past {
  .divider {
    position: relative;
    border-top: 1px var(--el-border-color) solid;
    display: block;
    height: 1px;
    margin: 24px 0;
    width: 100%;
  }
  .title {
    font-size: 18px;
    font-weight: 300;
    position: absolute;
    background-color: #f2f5f6;
    padding: 0 20px;
    top: -15px;
    left: 30px;
  }
  .tableShow {
    margin-top: 10px;
    display: grid;
    align-content: baseline;
    grid-template-columns: repeat(auto-fill, minmax(250px, 1fr));
    gap: 15px;
    width: 100%;
  }
  .page {
    padding: 20px;
    display: flex;
    justify-content: end;
  }
}
.classNotes {
  display: flex;
  align-items: center;
  gap: 10px;
  padding-top: 20px;
  .currentClass {
    font-size: 18px;
    font-weight: 600;
    padding: 2px 25px;
  }
  .smallClass {
    width: 100%;
    button {
      border: none;
      background-color: var(--el-bg-color);
      padding: 5px 15px;
      margin: 2px 4px;
      border-radius: 4px;
      cursor: pointer;
    }
  }
}
</style>
