<template>
  <div class="recommedviedohomePage">
    <p class="titelCommnt anchorpersontitle">推荐视频</p>
    <div class="recommedViedoMain">
      <div class="recommedViedoMainonce" v-for="(item,index) in viedoRecommedshow" :key="index">
        <div class="recommedViedoMainonceCenter">
          <div class="recommedViedoMainImg">
            <img src="@/assets/images/viedoImg/1.jpg" alt="" srcset="" />
            <div class="bottomviedoAbout">
              <span>
                <svg
                  t="1713691265032"
                  class="icon"
                  viewBox="0 0 1024 1024"
                  version="1.1"
                  xmlns="http://www.w3.org/2000/svg"
                  p-id="1541"
                  width="15"
                  height="15"
                >
                  <path
                    d="M772.7 217.7a32.2 32.1 0 1 0 64.4 0 32.2 32.1 0 1 0-64.4 0Z"
                    fill="#e6e6e6"
                    p-id="1542"
                  ></path>
                  <path
                    d="M415.8 679.9c5.9 0 11.5-1.6 16.2-4.5l231.1-134.6c10.9-5.2 18.5-16.3 18.5-29.2 0-11.9-6.4-22.3-16-27.8L439.7 352.2c-5.8-6.7-14.4-10.9-23.9-10.9-17.6 0-31.8 14.4-31.8 32.1 0 0.6 0 1.2 0.1 1.8l-0.4 0.2 0.5 269c-0.1 1.1-0.2 2.2-0.2 3.4 0 17.7 14.3 32.1 31.8 32.1z"
                    fill="#e6e6e6"
                    p-id="1543"
                  ></path>
                  <path
                    d="M909.8 306.6c-5.4-10.5-16.3-17.8-28.9-17.8-17.8 0-32.2 14.4-32.2 32.1 0 6 1.7 11.7 4.6 16.5l-0.1 0.1c26.9 52.4 42.1 111.8 42.1 174.7 0 211.6-171.6 383.2-383.2 383.2S128.8 723.8 128.8 512.2 300.4 129.1 512 129.1c62.5 0 121.5 15 173.6 41.5l0.2-0.4c4.6 2.6 10 4.1 15.7 4.1 17.8 0 32.2-14.4 32.2-32.1 0-13.1-7.9-24.4-19.3-29.4C653.6 81.9 584.9 64.5 512 64.5 264.7 64.5 64.3 265 64.3 512.2S264.7 959.9 512 959.9s447.7-200.4 447.7-447.7c0-74.1-18-144-49.9-205.6z"
                    fill="#e6e6e6"
                    p-id="1544"
                  ></path>
                </svg>
                <span class="bottomviedoAboutnumber"> 1111 </span>
              </span>
              <span>
                <svg t="1713691418065" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2005" width="15" height="15"><path d="M209.454545 349.090909h46.545455v46.545455H209.454545zM302.545455 349.090909h302.545454v46.545455H302.545455zM349.090909 465.454545h302.545455v46.545455H349.090909zM256 465.454545h46.545455v46.545455h-46.545455z" p-id="2006" fill="#e6e6e6"></path><path d="M728.436364 211.781818H155.927273c-58.181818 0-107.054545 46.545455-107.054546 107.054546v339.781818c0 58.181818 46.545455 107.054545 107.054546 107.054545h572.509091c58.181818 0 107.054545-48.872727 107.054545-107.054545V318.836364c0-58.181818-46.545455-107.054545-107.054545-107.054546z m65.163636 446.836364c0 37.236364-30.254545 65.163636-65.163636 65.163636H155.927273c-37.236364 0-65.163636-30.254545-65.163637-65.163636V318.836364c0-37.236364 30.254545-65.163636 65.163637-65.163637h572.509091c37.236364 0 65.163636 30.254545 65.163636 65.163637v339.781818z" p-id="2007" fill="#e6e6e6"></path></svg>
                <span class="bottomviedoAboutnumber"> 1111 </span>
              </span>
              <span>
                1qqq
              </span>
            </div>
          </div>
          <div class="recommendAbouttitleAndup">
            <div class="viedoTitle">
                <div>
                    快看我之前直播
                </div>
            </div>
            <div class="viedoTitleup">
             <span>
                <svg t="1713691886048" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1571" width="20" height="20"><path d="M510.548 105.582c-129.797 0-235.386 105.593-235.386 235.39 0 93.999 55.509 175.067 135.354 212.767-147.613 43.35-255.793 179.825-255.793 341.273 0 10.275 8.327 18.594 18.594 18.594 10.267 0 18.594-8.319 18.594-18.594 0-175.702 142.956-318.65 318.636-318.65 129.797 0 235.395-105.593 235.395-235.39s-105.598-235.39-235.395-235.39z m0 433.591c-109.294 0-198.197-88.917-198.197-198.202 0-109.29 88.903-198.202 198.197-198.202 109.298 0 198.206 88.912 198.206 198.202 0 109.29-88.903 198.202-198.206 198.202z m0 0z m215.838 72.907c-8.175-6.229-19.83-4.686-26.057 3.487-6.245 8.17-4.686 19.826 3.484 26.074 79.681 60.886 125.367 153.241 125.367 253.366 0 10.279 8.332 18.598 18.595 18.598 10.275 0 18.594-8.319 18.594-18.598 0-111.818-51.024-214.941-139.984-282.927z m0 0z" fill="#8a8a8a" p-id="1572"></path></svg>
             </span>
             <span class="viedoTitleupName">
                鹤归江野
             </span>
             <span class="viedoTitleupName">
                4-17
             </span>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import { reactive } from "vue";

const viedoRecommedshow=reactive([{},{},{},{},{}])
</script>
    <style lang="scss">
@import "@/views/client/styles/homePage/recommedType.scss";
@import "@/styles/component/component.scss";
</style>